
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>基于ssr 同构实现 | cocoo前端笔记</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-disqus/plugin.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-intopic-toc/style.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
        <link rel="stylesheet" href="styles/website.css">
        
    

        
<meta name="keywords" content="基于ssr 同构实现,cocoo前端笔记,www.css3.io">
    
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">


    
    <link rel="next" href="http.html" />
    
    
    <link rel="prev" href="react-defaultvalue-vs-value.html" />
    


    </head>
    <body>
        
    
<div class="gb-page-wrapper">
    <header class="gb-page-header">
        <div class="container">
        
            

            <a href="." class="logo">
                <img src="gitbook/images/logo/128.png">
                <h1>cocoo前端笔记</h1>
            </a>

            

            
                
                <a href="http.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-right"></i>
                </a>
                
                
                <a href="react-defaultvalue-vs-value.html" class="btn btn-link pull-right hidden-xs">
                    <i class="octicon octicon-chevron-left"></i>
                </a>
                
            
        
        </div>
    </header>

    <div class="gb-page-body">
        <div class="gb-page-inner">
            <div class="container">
                <div class="row">
                    <div class="col-md-3">
                        



    
    <div class="panel panel-default">
        

        <div class="list-group">
            
    
        
        <a href="./" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            关于我

        
        </a>
        

        
    
        
        <span class="list-group-item">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            Linux

        
        </span>
        

        
    
        
        <a href="vim.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            VIM

        
        </a>
        

        
    
        
        <span class="list-group-item">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            git

        
        </span>
        

        
    
        
        <a href="getting_started.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            开始实践

        
        </a>
        

        
    
        
        <a href="zui-jia-shi-jian.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            最佳实践

        
        </a>
        

        
    
        
        <a href="front_end_base.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            前端基础

        
        </a>
        

        
    
        
        <a href="rectfu-wu-duan-xuan-ran.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-down"></i>
            

            React架构

        
        </a>
        

        
        
    
        
        <a href="commonjs-vs-commonjs2.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            commonjs vs commonjs2

        
        </a>
        

        
    
        
        <a href="isomorphic-Is-not-perfect-as-you-think.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            同构并非想象中完美

        
        </a>
        

        
    
        
        <a href="react-defaultvalue-vs-value.html" class="list-group-item ">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            React defaultValue vs value

        
        </a>
        

        
    
        
        <a href="ji-yu-ssr-tong-gou-shi-xian.html" class="list-group-item active">
        

            
            <i class="octicon octicon-chevron-down" style="opacity: 0"></i>
            

            

            基于ssr 同构实现

        
        </a>
        

        
    

        
    
        
        <a href="http.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            网络

        
        </a>
        

        
    
        
        <a href="cao-zuo-xi-tong.html" class="list-group-item ">
        

            

            
            <i class="octicon octicon-chevron-right"></i>
            

            通俗易懂讲操作系统寻址

        
        </a>
        

        
    

        </div>
    </div>
    



                    </div>
                    <div class="col-md-9">
                        
                            
                            <div class="gb-markdown book-page-inner">
                                <p>&#x4E00;&#x3001;&#x6846;&#x67B6;&#x671F;&#x671B;&#x5B9E;&#x73B0;&#x7684;&#x6548;&#x679C;</p>
<p>1&#x3001;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x662F;spa&#x9879;&#x76EE;&#xFF0C;&#x4E14;&#x5177;&#x6709;&#x8D44;&#x6E90;&#x6309;&#x9875;&#x5206;&#x5305;&#x52A0;&#x8F7D;&#x7279;&#x6027;&#x3002;</p>
<p>2&#x3001;&#x670D;&#x52A1;&#x7AEF;&#x4E0D;&#x53C2;&#x4E0E;webpack&#x7F16;&#x8BD1;&#x3002;&#x5373;&#x53EA;&#x7F16;&#x8BD1;&#x524D;&#x7AEF;&#x5DE5;&#x7A0B;&#xFF0C;&#x7F16;&#x8BD1;&#x597D;&#x7684;&#x4EA7;&#x7269;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4E2D;&#x95F4;&#x4EF6;&#x5F15;&#x5165;&#x670D;&#x52A1;&#x7AEF;&#x9879;&#x76EE;&#x3002;</p>
<p>3&#x3001;spa&#x9879;&#x76EE;&#x6700;&#x597D;&#x53EA;&#x7F16;&#x8BD1;&#x4E00;&#x6B21;&#xFF0C;&#x4E0D;&#x56E0;&#x4E3A;&#x662F;&#x5426;&#x4F5C;&#x4E3A;ssr&#x9879;&#x76EE;&#x6A21;&#x5F0F;&#x800C;&#x533A;&#x522B;&#x7F16;&#x8BD1;&#x3002;</p>
<p>4&#x3001;ssr&#x9879;&#x76EE;&#x6A21;&#x5F0F;&#x548C;&#x666E;&#x901A;spa&#x6A21;&#x5F0F;&#x9879;&#x76EE;&#x80FD;&#x65E0;&#x7F1D;&#x4E92;&#x8F6C;&#x3002;&#x5B9E;&#x73B0;&#x5F00;&#x53D1;&#x8FD8;&#x662F;&#x8D70;&#x666E;&#x901A;&#x7684;spa&#x7684;&#x6A21;&#x5F0F;&#xFF0C;&#x53EA;&#x662F;&#x751F;&#x4EA7;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x6784;&#x5EFA;&#x4E3A;ssr&#x6A21;&#x5F0F;&#x9879;&#x76EE;&#x3002;&#x524D;&#x7AEF;&#x9879;&#x76EE;&#x80FD;&#x591F;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#xFF0C;&#x5305;&#x62EC;&#x5F00;&#x53D1;&#x548C;&#x751F;&#x4EA7;&#x9636;&#x6BB5;&#x5728;&#x6CA1;&#x6709;&#x540E;&#x7AEF;&#x9879;&#x76EE;&#x65F6;&#x80FD;&#x591F;&#x72EC;&#x7ACB;&#x8FD0;&#x884C;&#x3002;&#x4E14;&#x52A0;&#x4E0A;&#x540E;&#x7AEF;&#x9879;&#x76EE;&#x540E;&#x80FD;&#x591F;&#x7B80;&#x5355;&#x8F6C;&#x53D8;&#x4E3A;ssr&#x9879;&#x76EE;&#x6A21;&#x5F0F;&#x3002;</p>
<p>&#x4E8C;&#x3001;&#x5173;&#x952E;&#x5B9E;&#x73B0;&#x4E0E;&#x601D;&#x8DEF;</p>
<p>1&#x3001;&#x9009;&#x62E9;spa&#x9879;&#x76EE;&#x3002;spa&#x9879;&#x76EE;&#x8DDF;&#x591A;&#x9875;&#x9879;&#x76EE;&#x5177;&#x6709;&#x8F83;&#x5927;&#x4E0D;&#x540C;&#x3002;spa&#x9879;&#x76EE;&#x5FC5;&#x5B9A;&#x5305;&#x542B;&#x8DEF;&#x7531;&#x6A21;&#x5757;&#xFF0C;&#x6700;&#x7EC8;&#x5411;&#x5916;&#x66B4;&#x9732;&#x4E00;&#x4E2A;app&#x3002;&#x591A;&#x9875;&#x9879;&#x76EE;&#xFF0C;&#x6700;&#x7EC8;&#x5411;&#x5916;&#x66B4;&#x9732;&#x6BCF;&#x4E2A;&#x9875;&#x9762;&#x6A21;&#x5757;&#x3002;&#x5728;&#x4F5C;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#x9879;&#x76EE;&#x4F9D;&#x8D56;&#x65F6;&#xFF0C;spa&#x9879;&#x76EE;&#x4F5C;&#x4E3A;&#x66F4;&#x5355;&#x4E00;&#x6A21;&#x5757;&#x88AB;&#x5F15;&#x5165;&#xFF0C;&#x800C;&#x591A;&#x9875;&#x9879;&#x76EE;&#x5FC5;&#x987B;&#x518D;&#x6B21;&#x67B6;&#x6784;&#x4E0E;&#x5C01;&#x88C5;&#x8BBF;&#x95EE;url&#x4E0E;&#x9875;&#x9762;&#x7684;&#x5BF9;&#x5E94;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x6070;&#x597D;&#x662F;&#x91CD;&#x5199;&#x4E00;&#x4E2A;&#x8DEF;&#x7531;&#x3002;&#x5982;&#x679C;&#x591A;&#x9875;&#x9879;&#x76EE;&#x4E0D;&#x8003;&#x8651;&#x8FD9;&#x6B65;&#x5C01;&#x88C5;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x6709;&#x786C;&#x7F16;&#x7801;url &#x4E0E;&#x9875;&#x9762;&#x6A21;&#x5757;&#x7ED1;&#x5B9A;&#xFF0C;&#x4F1A;&#x589E;&#x52A0;&#x5F00;&#x53D1;&#x9636;&#x6BB5;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p>2&#x3001;&#x5C06;spa&#x8DEF;&#x7531;&#x6309;&#x9875;&#x5206;&#x5305;&#x5F02;&#x6B65;&#x8F6C;&#x4E3A;&#x540C;&#x6B65;&#x5316;&#x3002;&#x7531;&#x4E8E;spa&#x9879;&#x76EE;&#x591A;&#x91C7;&#x7528;&#x6309;&#x9875;&#x5206;&#x5305;&#x52A0;&#x8F7D;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8DEF;&#x7531;path&#x4E0D;&#x76F4;&#x63A5;&#x548C;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x7ED1;&#x5B9A;&#xFF0C;&#x800C;&#x662F;&#x548C;&#x4E00;&#x4E2A;&#x201C;&#x9AD8;&#x9636;&#x7EC4;&#x4EF6;&#x201D;&#x7ED1;&#x5B9A;&#x3002;&#x8FD9;&#x4E2A;&#x201C;&#x9AD8;&#x9636;&#x7EC4;&#x4EF6;&#x201C;&#x5176;&#x5B9E;&#x662F;&#x4E00;&#x4E2A;&#x5360;&#x4F4D;&#x4F5C;&#x7528;&#x3002;&#x5F53;&#x7528;&#x6237;&#x8BBF;&#x95EE;url&#xFF0C;&#x8DEF;&#x7531;&#x5148;&#x6E32;&#x67D3;&#x9AD8;&#x9636;&#x7EC4;&#x4EF6;&#xFF0C;&#x7531;&#x8FD9;&#x4E2A;&#x9AD8;&#x9636;&#x7EC4;&#x4EF6;&#x53BB;&#x5F02;&#x6B65;&#x83B7;&#x53D6;&#x8BE5;url&#x5BF9;&#x5E94;&#x6A21;&#x5757;&#x7684;&#x5206;&#x5305;&#x3002;&#x5F53;&#x5206;&#x5305;&#x4E0B;&#x8F7D;&#x5B8C;&#x6BD5;&#x4E14;&#x6A21;&#x5757;&#x52A0;&#x8F7D;ready&#x540E;&#xFF0C;&#x9AD8;&#x9636;&#x7EC4;&#x4EF6;&#x91CD;&#x65B0;&#x6E32;&#x67D3;&#x771F;&#x6B63;&#x7684;&#x6A21;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x9AD8;&#x9636;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5F00;&#x6E90;&#x5E93;react-loadable&#xFF0C;&#x5B9E;&#x73B0;&#x5E76;&#x4E0D;&#x590D;&#x6742;&#x3002;react-loadable &#x4E5F;&#x6709;ssr&#x65B9;&#x6848;&#xFF0C;&#x5176;&#x5B9E;&#x8FD9;&#x5957;&#x65B9;&#x6848;&#x5C31;&#x662F;&#x89E3;&#x51B3;&#x5F02;&#x6B65;&#x8F6C;&#x4E3A;&#x540C;&#x6B65;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x5957;&#x65B9;&#x6848;&#x4F7F;&#x7528;&#x5E76;&#x4E0D;&#x4E0D;&#x53CB;&#x597D;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x91CD;&#x5199;&#x4E86;&#x3002;&#x4EE5;&#x4E0A;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;react-loadable&#x7684;&#x539F;&#x7406;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x4EEC;&#x6765;&#x5177;&#x4F53;&#x5206;&#x6790;&#x5982;&#x4F55;&#x5B9E;&#x73B0;&#x5F02;&#x6B65;&#x8F6C;&#x540C;&#x6B65;&#x3002;</p>
<p>&#x5F80;&#x7B80;&#x5355;&#x8BF4;&#xFF0C;&#x5F53;&#x8F93;&#x5165;&#x4E00;&#x4E2A;url&#x7ED9;&#x54B1;&#x4EEC;&#x7684;&#x8DEF;&#x7531;&#x6A21;&#x5757;&#x65F6;&#xFF0C;&#x8DEF;&#x7531;&#x5E94;&#x8BE5;&#x8FD4;&#x56DE;&#x7ED9;&#x6211;&#x4EEC;url&#x5BF9;&#x5E94;&#x7684;&#x6A21;&#x5757;&#x7EC4;&#x4EF6; &#x3002;&#x7136;&#x540E;&#x54B1;&#x4EEC;&#x62FF;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x7EC4;&#x4EF6;&#x53BB;&#x8C03;&#x7528;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;api&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5B57;&#x7B26;&#x4E32;dom&#x3002;&#x4F46;&#x662F;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x57FA;&#x4E8E;&#x4EE3;&#x7801;&#x6309;&#x9875;&#x5206;&#x5305;&#x8DEF;&#x7531;&#xFF0C;&#x4F60;&#x53EA;&#x4F1A;&#x5F97;&#x5230;&#x201C;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#x201C;&#x3002;&#x9664;&#x975E;&#x4F60;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#xFF0C;&#x628A;&#x4E24;&#x90E8;&#x5206;&#x5207;&#x5272;&#x5F00;&#x3002;&#x7B2C;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4F60;&#x5148;&#x8BA9;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#x52A0;&#x8F7D;&#x5206;&#x5305;&#x7EC4;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x56DE;&#x8C03;&#x4F60;&#x5E76;&#x8868;&#x660E;&#x6B64;&#x65F6;&#x5206;&#x5305;&#x5DF2;&#x4E0B;&#x8F7D;&#xFF0C;&#x7EC4;&#x4EF6;&#x5DF2;&#x7ECF;ready&#x3002;&#x7B2C;&#x4E8C;&#x90E8;&#xFF0C;&#x5F53;&#x4F60;&#x518D;&#x6B21;&#x8C03;&#x7528;&#x8FD9;&#x4E2A;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#xFF0C;&#x8BA9;&#x5B83;&#x81EA;&#x52A8;&#x68C0;&#x6D4B;&#xFF0C;&#x662F;&#x5426;&#x4F60;&#x9700;&#x8981;&#x7684;&#x6A21;&#x5757;&#x5DF2;&#x7ECF;ready&#xFF0C;&#x5982;&#x679C;ready&#x76F4;&#x63A5;&#x8FD4;&#x56DE;&#x771F;&#x6B63;&#x7684;url&#x5BF9;&#x5E94;&#x7684;&#x6A21;&#x5757;&#x7EC4;&#x4EF6;&#x3002;&#x5360;&#x4F4D;&#x7EC4;&#x4EF6;&#x7531;&#x4E8E;&#x7B2C;&#x4E00;&#x6B65;&#x53BB;&#x8BBF;&#x95EE;&#x7F51;&#x7EDC;&#x4E86;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5C31;&#x4E0D;&#x7528;&#x8BBF;&#x95EE;&#x7F51;&#x7EDC;&#xFF0C;&#x6240;&#x4EE5;&#x5C31;&#x662F;&#x540C;&#x6B65;&#x4E86;&#x3002;</p>
<p>3&#x3001;&#x4ECE;&#x8BBF;&#x95EE;url&#xFF0C;&#x5F97;&#x5230;&#x5339;&#x914D;&#x7684;&#x9875;&#x9762;&#x6A21;&#x5757;&#x3002;</p>
<p>4&#x3001;&#x4ECE;&#x9875;&#x9762;&#x6A21;&#x5757;&#xFF0C;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x5206;&#x5305;&#x3002;&#x56E0;&#x4E3A;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;api &#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x4E3A;&#x4F60;&#x62FC;&#x63A5;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x5F53;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#x5230;&#x524D;&#x7AEF;&#x540E;&#xFF0C;&#x9700;&#x8981;&#x663E;&#x793A;&#x6837;&#x5F0F;&#xFF0C;&#x54CD;&#x5E94;&#x4E8B;&#x4EF6;&#x7B49;&#x3002;&#x6240;&#x4EE5;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x5BF9;&#x5E94;css &#x548C; js &#x8D44;&#x6E90;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x6302;&#x5728;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x4ECE;url&#x627E;&#x51FA;&#x9875;&#x9762;&#x6A21;&#x5757;&#x5F88;&#x5BB9;&#x6613;&#xFF0C;&#x6BD4;&#x5982;react-router &#x5C31;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x9759;&#x6001;&#x65B9;&#x6CD5;matchPath&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x5206;&#x6790;&#x5230;&#x8BBF;&#x95EE;&#x7684;url&#x547D;&#x4E2D;&#x54EA;&#x4E2A;&#x9875;&#x9762;&#x6A21;&#x5757;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x9875;&#x9762;&#x6A21;&#x5757;&#x627E;&#x5230;&#x5177;&#x4F53;&#x7684;&#x5206;&#x5305;&#x6709;&#x70B9;&#x96BE;&#x5EA6;&#x3002;import(&apos;&#x6A21;&#x5757;&#x8DEF;&#x5F84;&#x2018;)&#xFF0C; &#x8FD9;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x6A21;&#x5757;&#x3002;&#x7B2C;&#x4E00;&#x96BE;&#x70B9;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8981;&#x627E;&#x67D0;&#x4E2A;&#x6A21;&#x5757;&#x7684;&#x5206;&#x5305;&#xFF08;&#x5728;webpack&#x91CC;&#x53EB;bundle&#xFF09;&#xFF0C;&#x90A3;&#x4EE5;&#x4EC0;&#x4E48;&#x4E3A;key&#x53BB;&#x627E;&#x5462;&#xFF1F;&#x6A21;&#x5757;&#x8DEF;&#x5F84;&#xFF0C;&#x6A21;&#x5757;&#x5728;webpack&#x91CC;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#xFF1F;&#x8981;&#x5904;&#x7406;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x524D;&#x7F6E;&#x6761;&#x4EF6;&#x662F;&#x5BF9;webpack&#x7684;stats.json&#x9700;&#x8981;&#x5145;&#x5206;&#x4E86;&#x89E3;&#x548C;&#x5206;&#x6790;&#x3002;&#x6211;&#x4EEC;&#x5229;&#x7528;&#x4E86;webpack &#x7279;&#x6B8A;&#x53C2;&#x6570;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;stats.json&#x3002;&#x91CC;&#x9762;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5927;&#x81F4;&#x662F; [ { bundle: [&quot;xxxx.js&quot;,  &quot;xxx.css&quot;], origin: {}, modules:[]]&#xFF0C;&#x54B1;&#x4EEC;&#x901A;&#x8FC7;modules &#x8282;&#x70B9;&#xFF0C;&#x5224;&#x65AD;&#x8FD9;&#x4E2A;moudles&#x662F;&#x5426;&#x5305;&#x542B;&#x54B1;&#x4EEC;&#x7684;&#x9875;&#x9762;&#x6A21;&#x5757;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x67E5;&#x51FA;&#x8FD9;&#x4E2A;bundle&#x7684;&#x3002;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;origin&#x8282;&#x70B9;&#xFF0C;&apos;&#x6A21;&#x5757;&#x8DEF;&#x5F84;&#x2018; &#x4E5F;&#x53EF;&#x4EE5;&#x627E;&#x51FA;&#x8FD9;&#x4E2A;bundle&#x3002;&#x6211;&#x4EEC;&#x7528;&#x7684;&#x662F;&#x540E;&#x8005;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x98CE;&#x9669;&#x3002;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;module &#x53EF;&#x4EE5;&#x88AB;&#x591A;&#x4E2A;bundle &#x5F15;&#x7528;&#x3002;&#x54B1;&#x4EEC;&#x7EA6;&#x5B9A;&#x4E0B;&#x53EA;&#x6709;&#x9875;&#x9762;module&#x624D;&#x7528;import&#xFF08;&#xFF09;api&#x5427;&#x3002;&#x521A;&#x624D;&#x63D0;&#x5230;&#xFF0C;key&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x7684;key&#x73B0;&#x5728;&#x786E;&#x5B9A;&#x4E86;&#xFF0C;&#x53EF;&#x4EE5;&#x6709;&#x4E24;&#x79CD;&#x3002;&#x7B2C;&#x4E00;&#x79CD;&#x662F;moduleId&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;requestText&#xFF08;&#x5C31;&#x662F;import(&#xFF09;&#x7684;&#x53C2;&#x6570;)&#x3002;&#x8FD9;&#x91CC;&#x867D;&#x7136;&#x6211;&#x4EEC;&#x53EA;&#x7528;&#x5230;&#x4E86;&#x7B2C;&#x4E8C;&#x79CD;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;babel&#x63D2;&#x4EF6;&#xFF0C;&#x628A;component:() =&gt; import&#xFF08;&#xFF09;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x91CD;&#x65B0;&#x6539;&#x5199;&#x4E86;&#xFF0C;&#x52A0;&#x4E0A;&#x4E86;&#xFF0C;moduleId&#xFF0C;&#x548C;requestText&#xFF08;&#x514D;&#x5F97;&#x7528;&#x6237;&#x8981;&#x5199;&#x4E24;&#x6B21;&#x8FD9;&#x4E2A;&#x5B57;&#x7B26;&#x4E32;&#xFF09; &#x53D8;&#x6210;&#x4E86;</p>
<p>componet: () =&gt; {  moduleId: () =&gt; getMoudleId(), requestText: () =&gt; getRequestText(), module: import()}</p>
<p>4&#x3001;&#x521D;&#x59CB;&#x5316;&#x6570;&#x636E;&#x3002;&#x4E00;&#x822C;spa&#x9879;&#x76EE;&#x4E2D;&#xFF0C;&#x54B1;&#x4EEC;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7AEF;&#x6570;&#x636E;&#x4F1A;&#x653E;&#x5728;didMount&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#x3002;&#x5982;&#x679C;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;api&#xFF0C;&#x8FD9;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x662F;&#x4E0D;&#x8D70;&#x7684;&#x3002;&#x54B1;&#x4EEC;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x548C;nextjs &#x4E00;&#x6837;&#xFF0C;&#x4F5C;&#x4E3A;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x7684;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;axios&#x8FD9;&#x79CD;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x548C;nodejs&#x73AF;&#x5883;&#x90FD;&#x80FD;&#x8FD0;&#x884C;&#x7684;http&#x5E93;&#x3002;&#x6CA1;&#x9519;&#x73B0;&#x5728;&#x9636;&#x6BB5;&#x4EC5;&#x652F;&#x6301;http&#x3002;rpc&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x6D41;&#x884C;&#x7684;&#x65B9;&#x6848;&#xFF0C;&#x4F46;&#x662F;&#x76EE;&#x524D;&#x9636;&#x6BB5;&#x6CA1;&#x5728;&#x9879;&#x76EE;&#x4E2D;&#x5C1D;&#x8BD5;&#x8FC7;&#x3002;&#x670D;&#x52A1;&#x7AEF;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#x7AEF;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;typeof window&#x6765;&#x5224;&#x522B;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x670D;&#x52A1;&#x7AEF;host&#x6620;&#x5C04;&#xFF0C;&#x8D70;&#x66F4;&#x7A33;&#x5B9A;&#x7684;&#x5185;&#x7F51;&#x73AF;&#x5883;&#x3002;&#x603B;&#x4E4B;&#x8FD9;&#x4E0D;&#x662F;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x7684;&#x8303;&#x56F4;&#x3002;&#x5F53;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x88AB;&#x4E0B;&#x8F7D;ready&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x8C03;&#x7528;&#x4ED6;&#x7684;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x6765;&#x83B7;&#x53D6;&#x670D;&#x52A1;&#x7AEF;&#x6570;&#x636E;&#x3002;&#x7EC6;&#x5FC3;&#x7684;&#x5C0F;&#x4F19;&#x4F34;&#x53EF;&#x80FD;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x4F18;&#x5316;&#x70B9;&#xFF0C;&#x5C31;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#x6570;&#x636E;&#x548C;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x5206;&#x5305;&#x662F;&#x4E32;&#x8FDE;&#x4E0B;&#x8F7D;&#x7684;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x628A;&#x9759;&#x6001;&#x65B9;&#x6CD5;&#x653E;&#x5230;&#x548C;&#x9875;&#x9762;&#x7EC4;&#x4EF6;&#x8DEF;&#x7531;&#x914D;&#x7F6E;&#x5730;&#x65B9;&#xFF0C;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x3002;&#x4F46;&#x662F;main&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x4E1A;&#x52A1;&#x589E;&#x5927;&#x3002;</p>
<p>5&#x3001;&#x5BFC;&#x51FA;&#x524D;&#x7AEF;&#x4EA7;&#x51FA;&#xFF0C;&#x4F5C;&#x4E3A;&#x5E93;&#x4F9B;&#x540E;&#x7AEF;&#x9879;&#x76EE;&#x5F15;&#x5165;&#x3002;&#x8FD9;&#x4E2A;&#x70B9;&#x9700;&#x8981;&#x8003;&#x9A8C;webpack&#x529F;&#x5E95;&#x4E86;&#x3002;webpack &#x6709;&#x4E00;&#x5957;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6765;&#x88C5;&#x8F7D;&#x6A21;&#x5757;&#x3002;&#x7B80;&#x5355;&#x8BF4;&#x5C31;&#x662F;require&#x4E00;&#x4E2A;&#x6A21;&#x5757;&#x65F6;&#xFF0C;webpack&#x9700;&#x8981;&#x77E5;&#x9053;&#x8FD9;&#x4E2A;&#x6A21;&#x5757;&#x7684;bundle&#x6709;&#x6CA1;&#x6709;&#x4E0B;&#x8F7D;&#x4E0B;&#x6765;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4E0B;&#x8F7D;&#xFF0C;&#x9700;&#x8981;&#x5148;&#x53BB;&#x4E0B;&#x8F7D;bundle&#x3002;&#x5B58;&#x653E;&#x7684;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x901A;&#x5E38;&#x6302;&#x5728;&#x5168;&#x5C40;&#x5BF9;&#x8C61;&#x4E0A;&#xFF0C;&#x6D4F;&#x89C8;&#x5668;&#x6302;&#x8F7D;window&#x4E0B;&#xFF0C;nodejs&#x6302;&#x5728;global&#x3002;&#x8FD9;&#x662F;&#x4F60;&#x4E3A;&#x4EC0;&#x4E48;buidle nodejs&#x65F6;&#x9700;&#x8981;&#x8BBE;&#x7F6E;target&#x4E3A;node&#x7684;&#x539F;&#x56E0;&#x4E4B;&#x4E00;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E0D;&#x8BBE;&#x7F6E;&#x8FD9;&#x4E2A;target&#x4E3A;node&#xFF0C;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x4E0D;&#x533A;&#x522B;&#x7F16;&#x8BD1;&#x3002;&#x8981;&#x60F3;&#x4E24;&#x7AEF;&#x90FD;&#x80FD;&#x8DD1;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;globalObject&#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x4E3A;&quot;(typeof window !== &apos;undefined&apos; ? window : global)&quot;, &#x5C31;&#x80FD;&#x81EA;&#x52A8;&#x8BC6;&#x522B;&#x5168;&#x5C40;&#x73AF;&#x5883;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x6709;&#x540C;&#x6837;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;mini-css-extract-plugin&#x4EA7;&#x751F;&#x7684;&#x4EE3;&#x7801;&#xFF0C;&#x5B83;&#x9700;&#x8981;&#x5224;&#x65AD;css&#x662F;&#x5426;&#x52A0;&#x8F7D;&#x3002;&#x5982;&#x679C;&#x6CA1;&#x6709;,&#x4F1A;&#x521B;&#x5EFA;&#x5E76;&#x6302;&#x8F7D; link &#x6807;&#x7B7E;&#x5230;window&#x4E0B;&#x3002;&#x5982;&#x679C;&#x662F;&#x670D;&#x52A1;&#x7AEF;&#xFF0C;&#x54B1;&#x4EEC;&#x53EF;&#x6CA1;&#x6709;window&#x5BF9;&#x8C61;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x521B;&#x5EFA;link&#x6807;&#x7B7E;&#xFF0C;&#x5FC5;&#x5B9A;&#x62A5;&#x9519;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x5728;&#x670D;&#x52A1;&#x7AEF;&#x9700;&#x8981;&#x8DF3;&#x8FC7;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#xFF0C;&#x6BD5;&#x7ADF;&#x670D;&#x52A1;&#x7AEF;&#x62FC;&#x5B57;&#x7B26;&#x4E32;&#x65F6;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x6CE8;css&#x3002;&#x6211;&#x4EEC;&#x548C;mini-css-extract-plugin &#x63D0;issu&#x4E86;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x6CA1;&#x6709;&#x91C7;&#x7EB3;&#x6211;&#x4EEC;&#x610F;&#x89C1;&#x3002;&#x53EA;&#x6709;&#x81EA;&#x5DF1;&#x53D1;&#x5E03;&#x4E00;&#x4E2A;mini-css-extract-plugin-ssr&#xFF0C;&#x53EA;&#x6539;&#x4E86;&#x4E00;&#x884C;&#x4EE3;&#x7801;&#x3002;&#x4EC5;&#x4EC5;&#x4E3A;&#x4E86;&#x8DF3;&#x8FC7;&#x8FD9;&#x4E2A;&#x903B;&#x8F91;&#x3002;ok&#x6700;&#x540E;&#x4E00;&#x6B65;&#xFF0C;&#x54B1;&#x4EEC;&#x628A;index.js&#x4F5C;&#x4E3A;umd&#x6A21;&#x5757;&#x5BFC;&#x51FA;&#xFF0C;&#x4E3A;&#x5565;&#x4F5C;&#x4E3A;umd&#xFF0C;&#x56E0;&#x4E3A;umd&#x5305;&#x62EC;commonjs&#x6240;&#x4EE5;&#x80FD;&#x4F5C;&#x4E3A;&#x5E93;&#x4E91;&#x884C;&#xFF0C;&#x53C8;&#x80FD;&#x5728;&#x6CA1;&#x6709;&#x6A21;&#x5757;&#x89C4;&#x8303;&#x65F6;&#x81EA;&#x52A8;&#x8FD0;&#x884C;&#x3002;&#x5373;&#x65E2;&#x80FD;&#x4F5C;&#x4E3A;&#x5E93;&#xFF0C;&#x53C8;&#x80FD;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x81EA;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x5F88;&#x91CD;&#x8981;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x91CC;&#x4E0D;&#x8BA8;&#x8BBA;amd&#xFF0C;&#x8DDF;&#x5B83;&#x6CA1;&#x4E00;&#x6BDB;&#x94B1;&#x5173;&#x7CFB;&#x3002;</p>

                            </div>
                            
                        
                    </div>
                </div>
            </div>
        </div>
    </div>

    <footer class="gb-page-footer">
        <div class="container">
            <ul class="menu">
                <li class="pull-right">
                    <span class="service-info">Copyright GitBook 2020</span>
                </li>
                <li>
                    <a href="#">Return to the top</a>
                </li>
                <li>
                    <a href="#">Updated Apr 17th 20</a>
                </li>
            </ul>
        </div>
    </footer>
</div>

<script src="gitbook/gitbook.js"></script>

    
    <script src="gitbook/gitbook-plugin-ga/plugin.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-baidu_gio/plugin.js"></script>
    

    
    <script src="https://cdnjs.cloudflare.com/ajax/libs/URI.js/1.16.1/URI.min.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-disqus/plugin.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-intopic-toc/anchor.min.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-intopic-toc/gumshoe.min.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-intopic-toc/plugin.js"></script>
    

    
    <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
    

<script>
(function() {
    gitbook.page.hasChanged({"page":{"title":"基于ssr 同构实现","level":"1.8.4","depth":2,"next":{"title":"网络","level":"1.9","depth":1,"path":"http.md","ref":"http.md","articles":[{"title":"1.http connection history","level":"1.9.1","depth":2,"path":"http-history.md","ref":"http-history.md","articles":[]},{"title":"2.ssl握手","level":"1.9.2","depth":2,"path":"sslwo-shou.md","ref":"sslwo-shou.md","articles":[]}]},"previous":{"title":"React defaultValue vs value","level":"1.8.3","depth":2,"path":"react-defaultvalue-vs-value.md","ref":"react-defaultvalue-vs-value.md","articles":[]},"dir":"ltr"},"config":{"plugins":["theme-official","ga","baidu_gio","-search","-lunr","-sharing","sitemap","disqus","intopic-toc"],"styles":{"website":"styles/website.css"},"pluginsConfig":{"disqus":{"useIdentifier":false,"shortName":"css3io"},"intopic-toc":{"label":"Navigation","selector":".markdown-section h2","visible":true},"baidu_gio":{"token":"3b06928c84dad0b03dc0fdca98e190c9"},"theme-official":{},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"sitemap":{"hostname":"https://www.css3.io/"},"ga":{"configuration":{"cookieName":"www.css3.io","cookieDomain":"www.css3.io"},"token":"UA-48397157-2"},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"cocoo前端笔记","links":{"sidebar":{"www.css3.io":"https://www.css3.io"}},"gitbook":"*","description":"cocoo前端笔记(www.css3.io)是李俊(8427003@qq.com)个人技术blog"},"file":{"path":"ji-yu-ssr-tong-gou-shi-xian.md","mtime":"2020-04-17T04:08:30.224Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2020-04-17T04:09:34.240Z"},"basePath":".","book":{"language":""}});
})();
</script>


        
    
    <script>
    (function(){
        var bp = document.createElement('script');
        var curProtocol = window.location.protocol.split(':')[0];
        if (curProtocol === 'https') {
            bp.src = 'https://zz.bdstatic.com/linksubmit/push.js';        
        }
        else {
            bp.src = 'http://push.zhanzhang.baidu.com/push.js';
        }
        var s = document.getElementsByTagName("script")[0];
        s.parentNode.insertBefore(bp, s);
    })();
    </script>

    </body>
</html>

